c5/src/Documents/ProjectsPayment/ProjectsPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProjectsPayment</name>
  <basedOn>Document.ProjectsInvoice</basedOn>
  <registerRecords>AccumulationRegister.ProjectDebts</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.ProjectsInvoice</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

c5/src/AccumulationRegisters/ProjectDebts/ProjectDebts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ProjectDebts</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.ProjectsInvoice</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

c5/src/Documents/ProjectsInvoice/ProjectsInvoice.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProjectsInvoice</name>
  <registerRecords>AccumulationRegister.ProjectDebts</registerRecords>
  <registerRecords>AccumulationRegister.ProjectSales</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceMethod</name>
    <type>
      <types>EnumRef.InvoiceMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Notes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SalesTax1</name>
    <type>
      <types>CatalogRef.TaxItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTax2</name>
    <type>
      <types>CatalogRef.TaxItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesTaxAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>ServicesDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Terms</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TwoSalesTaxes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>Minutes</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxAmount1</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxAmount2</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesTaxTotalAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeEntry</name>
      <type>
        <types>DocumentRef.TimeEntry</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/ProjectsPayment/Forms/Form/Module.bsl
&AtServer
var Base;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )

	updateChangesPermission ();

EndProcedure

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		setCreator ();
		updateChangesPermission ();
	endif; 
	if ( TypeOf ( Parameters.Basis ) = Type ( "DocumentRef.ProjectsInvoice" ) ) then
		fillByInvoice ();
	endif;
	StandardButtons.Arrange ( ThisObject );
		
EndProcedure

&AtServer
Procedure setCreator ()
	
	Object.Creator = SessionParameters.User;
	
EndProcedure 

#region Filling

&AtServer
Procedure fillByInvoice ()
	
	getInvoiceData ();
	fillHeaderByInvoice ();
	
EndProcedure 

&AtServer
Procedure getInvoiceData ()
	
	initBase ();
	sqlInvoice ();
	SQL.Perform ( Base );
	
EndProcedure

&AtServer
Procedure initBase ()
	
	Base = new Structure ();
	SQL.Init ( Base );
	Base.Q.SetParameter ( "Base", Parameters.Basis );
	
EndProcedure 

&AtServer
Procedure sqlInvoice ()
	
	s = "
	|// @Fields
	|select allowed Invoices.Customer as Customer, Payments.AmountBalance as Amount
	|from Document.ProjectsInvoice as Invoices
	|	//
	|	// Payments
	|	//
	|	left join AccumulationRegister.ProjectDebts.Balance ( , Invoice = &Base ) as Payments
	|	on Payments.Invoice = Invoices.Ref
	|where Invoices.Ref = &Base
	|";
	Base.Selection.Add ( s );
	
EndProcedure

&AtServer
Procedure fillHeaderByInvoice ()
	
	Object.Customer = Base.Fields.Customer;
	Object.Amount = Base.Fields.Amount;
	Object.Invoice = Parameters.Basis;
	
EndProcedure 

#endregion

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );

EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )

	updateChangesPermission ();
	
EndProcedure

&AtClient
Procedure InvoiceOnChange ( Item )
	
	setAmount ();
	
EndProcedure

&AtClient
Procedure setAmount ()
	
	Object.Amount = getAmount ( Object.Invoice );
	
EndProcedure 

&AtServerNoContext
Function getAmount ( val Invoice )
	
	s = "
	|select Balances.AmountBalance as Amount
	|from AccumulationRegister.ProjectDebts.Balance ( , Invoice = &Invoice ) as Balances
	|";
	q = new Query ( s );
	q.SetParameter ( "Invoice", Invoice );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, 0, table [ 0 ].Amount );
	
EndFunction
